app/controllers/cliqs_controller.rb

  def index
    @search = params['search'] if params['search']
    @cliq = Cliq.find(7)
    @descendants = @cliq.descendants.select(:id).order("updated_at desc").limit(10).collect(&:id)
    @descendants << @cliq.id
    @topics = Topic.where(cliq_id: @descendants).order("updated_at desc").limit(10)
---
SELECT "cliqs".* FROM "cliqs"  WHERE (rgt >= CAST(0.16666666666666666 AS FLOAT) AND lft < CAST(0.15384615384615385 AS FLOAT))
SELECT  "cliqs"."id" FROM "cliqs"  WHERE (lftp > 0 AND lft BETWEEN 0.0 AND 1.0)  ORDER BY updated_at desc LIMIT 10
SELECT  "topics".* FROM "topics"  WHERE "topics"."cliq_id" IN (11, 13, 18, 17, 12, 8, 14, 10, 7)  ORDER BY updated_at desc LIMIT 10

  def show
    @search = params['search'] if params['search']
    @descendants = @cliq.descendants.select(:id).order("updated_at desc").limit(10).collect(&:id)
    @descendants << @cliq.id
    @topics = Topic.where(cliq_id: @descendants).order("updated_at desc").limit(10)
---
SELECT  "topics".* FROM "topics"  WHERE "topics"."cliq_id" IN (14, 10, 8)  ORDER BY updated_at_desc LIMIT 10

  def set_cliq
    @cliq = Cliq.find(params[:id])
---
SELECT  "cliqs".* FROM "cliqs"  WHERE (rgt >= CAST(0.6666666666666666 AS FLOAT) AND lft < CAST(0.6 AS FLOAT))  ORDER BY "cliqs"."id" DESC LIMIT 1