app/controllers/topics_controller.rb

  def index
    @topics = Topic.limit(10).order(:created_at)
---
SELECT  "topics".* FROM "topics"   ORDER BY "topics"."created_at" ASC LIMIT 10

  def create
    @topic = Topic.new(topic_params)
    @topic.cliq_id = params['cliq_id']
    @topic.user_id = current_user.id
    @cliq = Cliq.find(params['cliq_id'])
    @cliq.touch
    respond_to do |format|
      if @topic.save
---
SELECT  "cliqs".* FROM "cliqs"  WHERE "cliqs"."id" = $1 LIMIT 1  [["id", 8]]
UPDATE "cliqs" SET "updated_at" = '2014-07-19 04:15:03.200344' WHERE "cliqs"."id" = 10
INSERT INTO "topics" ("body", "cliq_id", "created_at", "subject", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def set_cliq
    @cliq = Cliq.find(params[:cliq_id])
---
SELECT  "cliqs".* FROM "cliqs"  WHERE "cliqs"."id" = $1 LIMIT 1  [["id", 9]]