app/views/cliqs/show.html.haml

      =" - "
      -get_ancestors(t.cliq).each do |desc|
---
SELECT "cliqs".* FROM "cliqs"  WHERE (rgt >= CAST(1.0 AS FLOAT) AND lft < CAST(0.6666666666666666 AS FLOAT))